load-tests/crdt-tests/artillery-tests2.yml
config:
  target: 'http://localhost:3000'
  phases:
    - duration: 60
      arrivalRate: 50
    - duration: 30
      arrivalRate: 100
    - duration: 60
      arrivalRate: 200
  processor: "./artillery-processor.js"
scenarios:
  - name: Large Document Operations
    flow:
      - post:
          url: '/reset-document'
          json:
            initialDocument: "{{ repeat('A', 10000) }}"
      - loop:
          - count: 100
            flow:
              - post:
                  url: '/apply-operation'
                  json:
                    operation:
                      type: "{{ randomInt(0, 1) === 0 ? 'insert' : 'delete' }}"
                      position: "{{ randomInt(0, 10000) }}"
                      text: "{{ repeat('X', randomInt(1, 10)) }}"
                      length: "{{ randomInt(1, 10) }}"
                      vectorClock:
                        client1: "{{ randomInt(1, 10) }}"
                      clientId: "client{{ randomInt(1, 10) }}"
              - get:
                  url: '/document'
                  capture:
                    - json: '$.document'
                      as: 'document'
              - log: 'Document after large operation: {{ document.length }} characters'